Ran Plan for 2 projects:

1. dir: `devops-dev/t1/eu-central-1/skeleton/ecs_clusters/mycluster5` workspace: `devops-dev_t1_eu-central-1_skeleton_ecs_clusters_mycluster5`
1. dir: `devops-dev/global/eu-central-1/common/vpc/dev3` workspace: `devops-dev_global_eu-central-1_common_vpc_dev3`
---

### 1. dir: `devops-dev/t1/eu-central-1/skeleton/ecs_clusters/mycluster5` workspace: `devops-dev_t1_eu-central-1_skeleton_ecs_clusters_mycluster5`
<details><summary>Show Output</summary>

```diff
10:04:48.327 WARN   The `TERRAGRUNT_TFPATH` environment variable is deprecated and will be removed in a future version of Terragrunt. Use `TG_TF_PATH=terraform1.10.5` instead.
10:04:51.816 WARN   Config ../../../../../global/eu-central-1/common/vpc/dev3/terragrunt.hcl is a dependency of ./terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
10:04:51.931 WARN   Config ../../../../../global/eu-central-1/common/vpc/dev3/terragrunt.hcl is a dependency of ./terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
10:05:21.416 STDOUT terraform1.10.5: Terraform used the selected providers to generate the following execution
10:05:21.416 STDOUT terraform1.10.5: plan. Resource actions are indicated with the following symbols:
10:05:21.416 STDOUT terraform1.10.5:   + create
10:05:21.416 STDOUT terraform1.10.5: Terraform will perform the following actions:
10:05:21.417 STDOUT terraform1.10.5:   # module.autoscaling["on-demand"].aws_autoscaling_group.idc[0] will be created
10:05:21.417 STDOUT terraform1.10.5:   + resource "aws_autoscaling_group" "idc" {
10:05:21.417 STDOUT terraform1.10.5:       + arn                              = (known after apply)
10:05:21.417 STDOUT terraform1.10.5:       + availability_zones               = (known after apply)
10:05:21.417 STDOUT terraform1.10.5:       + default_cooldown                 = (known after apply)
10:05:21.417 STDOUT terraform1.10.5:       + desired_capacity                 = (known after apply)
10:05:21.417 STDOUT terraform1.10.5:       + force_delete                     = false
10:05:21.417 STDOUT terraform1.10.5:       + force_delete_warm_pool           = false
10:05:21.417 STDOUT terraform1.10.5:       + health_check_grace_period        = 300
10:05:21.417 STDOUT terraform1.10.5:       + health_check_type                = "EC2"
10:05:21.417 STDOUT terraform1.10.5:       + id                               = (known after apply)
10:05:21.417 STDOUT terraform1.10.5:       + ignore_failed_scaling_activities = false
10:05:21.417 STDOUT terraform1.10.5:       + load_balancers                   = (known after apply)
10:05:21.417 STDOUT terraform1.10.5:       + max_size                         = 2
10:05:21.417 STDOUT terraform1.10.5:       + metrics_granularity              = "1Minute"
10:05:21.417 STDOUT terraform1.10.5:       + min_size                         = 1
10:05:21.417 STDOUT terraform1.10.5:       + name                             = "t1-skeleton-eu-central-1-mycluster5-on-demand"
10:05:21.417 STDOUT terraform1.10.5:       + name_prefix                      = (known after apply)
10:05:21.418 STDOUT terraform1.10.5:       + predicted_capacity               = (known after apply)
10:05:21.418 STDOUT terraform1.10.5:       + protect_from_scale_in            = true
10:05:21.418 STDOUT terraform1.10.5:       + service_linked_role_arn          = (known after apply)
10:05:21.418 STDOUT terraform1.10.5:       + target_group_arns                = (known after apply)
10:05:21.418 STDOUT terraform1.10.5:       + termination_policies             = [
10:05:21.418 STDOUT terraform1.10.5:           + "ClosestToNextInstanceHour",
10:05:21.418 STDOUT terraform1.10.5:         ]
10:05:21.418 STDOUT terraform1.10.5:       + vpc_zone_identifier              = [
10:05:21.418 STDOUT terraform1.10.5:           + "subnet-123456",
10:05:21.418 STDOUT terraform1.10.5:         ]
10:05:21.418 STDOUT terraform1.10.5:       + wait_for_capacity_timeout        = "10m"
10:05:21.418 STDOUT terraform1.10.5:       + warm_pool_size                   = (known after apply)
10:05:21.418 STDOUT terraform1.10.5:       + availability_zone_distribution (known after apply)
10:05:21.418 STDOUT terraform1.10.5:       + launch_template {
10:05:21.418 STDOUT terraform1.10.5:           + id      = (known after apply)
10:05:21.418 STDOUT terraform1.10.5:           + name    = (known after apply)
10:05:21.418 STDOUT terraform1.10.5:           + version = "$Latest"
10:05:21.418 STDOUT terraform1.10.5:         }
10:05:21.418 STDOUT terraform1.10.5:       + mixed_instances_policy (known after apply)
10:05:21.418 STDOUT terraform1.10.5:       + tag {
10:05:21.418 STDOUT terraform1.10.5:           + key                 = "AmazonECSManaged"
10:05:21.418 STDOUT terraform1.10.5:           + propagate_at_launch = true
10:05:21.418 STDOUT terraform1.10.5:           + value               = "true"
10:05:21.418 STDOUT terraform1.10.5:         }
10:05:21.418 STDOUT terraform1.10.5:       + tag {
10:05:21.418 STDOUT terraform1.10.5:           + key                 = "Environment"
10:05:21.418 STDOUT terraform1.10.5:           + propagate_at_launch = true
10:05:21.418 STDOUT terraform1.10.5:           + value               = "t1"
10:05:21.418 STDOUT terraform1.10.5:         }
10:05:21.418 STDOUT terraform1.10.5:       + tag {
10:05:21.418 STDOUT terraform1.10.5:           + key                 = "Name"
10:05:21.419 STDOUT terraform1.10.5:           + propagate_at_launch = true
10:05:21.419 STDOUT terraform1.10.5:           + value               = "t1-skeleton-eu-central-1-mycluster5-on-demand"
10:05:21.419 STDOUT terraform1.10.5:         }
10:05:21.419 STDOUT terraform1.10.5:       + tag {
10:05:21.419 STDOUT terraform1.10.5:           + key                 = "Namespace"
10:05:21.419 STDOUT terraform1.10.5:           + propagate_at_launch = true
10:05:21.419 STDOUT terraform1.10.5:           + value               = "skeleton"
10:05:21.419 STDOUT terraform1.10.5:         }
10:05:21.419 STDOUT terraform1.10.5:       + tag {
10:05:21.419 STDOUT terraform1.10.5:           + key                 = "Region"
10:05:21.419 STDOUT terraform1.10.5:           + propagate_at_launch = true
10:05:21.419 STDOUT terraform1.10.5:           + value               = "eu-central-1"
10:05:21.419 STDOUT terraform1.10.5:         }
10:05:21.419 STDOUT terraform1.10.5:       + timeouts {}
10:05:21.419 STDOUT terraform1.10.5:       + traffic_source (known after apply)
10:05:21.419 STDOUT terraform1.10.5:     }
10:05:21.419 STDOUT terraform1.10.5:   # module.autoscaling["on-demand"].aws_iam_instance_profile.this[0] will be created
10:05:21.419 STDOUT terraform1.10.5:   + resource "aws_iam_instance_profile" "this" {
10:05:21.419 STDOUT terraform1.10.5:       + arn         = (known after apply)
10:05:21.419 STDOUT terraform1.10.5:       + create_date = (known after apply)
10:05:21.419 STDOUT terraform1.10.5:       + id          = (known after apply)
10:05:21.419 STDOUT terraform1.10.5:       + name        = "t1-skeleton-eu-central-1-mycluster5-on-demand-role"
10:05:21.419 STDOUT terraform1.10.5:       + name_prefix = (known after apply)
10:05:21.419 STDOUT terraform1.10.5:       + path        = "/"
10:05:21.419 STDOUT terraform1.10.5:       + role        = "t1-skeleton-eu-central-1-mycluster5-on-demand-role"
10:05:21.419 STDOUT terraform1.10.5:       + tags        = {
10:05:21.420 STDOUT terraform1.10.5:           + "Environment" = "t1"
10:05:21.420 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
10:05:21.420 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
10:05:21.420 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
10:05:21.420 STDOUT terraform1.10.5:         }
10:05:21.420 STDOUT terraform1.10.5:       + tags_all    = {
10:05:21.420 STDOUT terraform1.10.5:           + "Environment" = "t1"
10:05:21.420 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
10:05:21.420 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
10:05:21.420 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
10:05:21.420 STDOUT terraform1.10.5:         }
10:05:21.420 STDOUT terraform1.10.5:       + unique_id   = (known after apply)
10:05:21.420 STDOUT terraform1.10.5:     }
10:05:21.420 STDOUT terraform1.10.5:   # module.autoscaling["on-demand"].aws_iam_role.this[0] will be created
10:05:21.420 STDOUT terraform1.10.5:   + resource "aws_iam_role" "this" {
10:05:21.420 STDOUT terraform1.10.5:       + arn                   = (known after apply)
10:05:21.420 STDOUT terraform1.10.5:       + assume_role_policy    = jsonencode(
10:05:21.420 STDOUT terraform1.10.5:             {
10:05:21.420 STDOUT terraform1.10.5:               + Statement = [
10:05:21.420 STDOUT terraform1.10.5:                   + {
10:05:21.421 STDOUT terraform1.10.5:                       + Action    = "sts:AssumeRole"
10:05:21.421 STDOUT terraform1.10.5:                       + Effect    = "Allow"
10:05:21.421 STDOUT terraform1.10.5:                       + Principal = {
10:05:21.421 STDOUT terraform1.10.5:                           + Service = "ec2.amazonaws.com"
10:05:21.421 STDOUT terraform1.10.5:                         }
10:05:21.421 STDOUT terraform1.10.5:                       + Sid       = "EC2AssumeRole"
10:05:21.421 STDOUT terraform1.10.5:                     },
10:05:21.421 STDOUT terraform1.10.5:                 ]
10:05:21.421 STDOUT terraform1.10.5:               + Version   = "2012-10-17"
10:05:21.421 STDOUT terraform1.10.5:             }
10:05:21.421 STDOUT terraform1.10.5:         )
10:05:21.421 STDOUT terraform1.10.5:       + create_date           = (known after apply)
10:05:21.421 STDOUT terraform1.10.5:       + description           = "ECS role for t1-skeleton-eu-central-1-mycluster5"
10:05:21.421 STDOUT terraform1.10.5:       + force_detach_policies = true
10:05:21.421 STDOUT terraform1.10.5:       + id                    = (known after apply)
10:05:21.421 STDOUT terraform1.10.5:       + managed_policy_arns   = (known after apply)
10:05:21.421 STDOUT terraform1.10.5:       + max_session_duration  = 3600
10:05:21.421 STDOUT terraform1.10.5:       + name                  = "t1-skeleton-eu-central-1-mycluster5-on-demand-role"
10:05:21.421 STDOUT terraform1.10.5:       + name_prefix           = (known after apply)
10:05:21.421 STDOUT terraform1.10.5:       + path                  = "/"
10:05:21.421 STDOUT terraform1.10.5:       + tags                  = {
10:05:21.421 STDOUT terraform1.10.5:           + "Environment" = "t1"
10:05:21.421 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
10:05:21.421 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
10:05:21.421 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
10:05:21.421 STDOUT terraform1.10.5:         }
10:05:21.421 STDOUT terraform1.10.5:       + tags_all              = {
10:05:21.421 STDOUT terraform1.10.5:           + "Environment" = "t1"
10:05:21.421 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
10:05:21.421 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
10:05:21.422 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
10:05:21.422 STDOUT terraform1.10.5:         }
10:05:21.422 STDOUT terraform1.10.5:       + unique_id             = (known after apply)
10:05:21.422 STDOUT terraform1.10.5:       + inline_policy (known after apply)
10:05:21.422 STDOUT terraform1.10.5:     }
10:05:21.423 STDOUT terraform1.10.5:   # module.autoscaling["on-demand"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerServiceforEC2Role"] will be created
10:05:21.423 STDOUT terraform1.10.5:   + resource "aws_iam_role_policy_attachment" "this" {
10:05:21.423 STDOUT terraform1.10.5:       + id         = (known after apply)
10:05:21.423 STDOUT terraform1.10.5:       + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
10:05:21.423 STDOUT terraform1.10.5:       + role       = "t1-skeleton-eu-central-1-mycluster5-on-demand-role"
10:05:21.423 STDOUT terraform1.10.5:     }
10:05:21.423 STDOUT terraform1.10.5:   # module.autoscaling["on-demand"].aws_iam_role_policy_attachment.this["AmazonSSMManagedInstanceCore"] will be created
10:05:21.423 STDOUT terraform1.10.5:   + resource "aws_iam_role_policy_attachment" "this" {
10:05:21.423 STDOUT terraform1.10.5:       + id         = (known after apply)
10:05:21.423 STDOUT terraform1.10.5:       + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
10:05:21.423 STDOUT terraform1.10.5:       + role       = "t1-skeleton-eu-central-1-mycluster5-on-demand-role"
10:05:21.423 STDOUT terraform1.10.5:     }
10:05:21.423 STDOUT terraform1.10.5:   # module.autoscaling["on-demand"].aws_launch_template.this[0] will be created
10:05:21.423 STDOUT terraform1.10.5:   + resource "aws_launch_template" "this" {
10:05:21.423 STDOUT terraform1.10.5:       + arn                    = (known after apply)
10:05:21.423 STDOUT terraform1.10.5:       + default_version        = (known after apply)
10:05:21.423 STDOUT terraform1.10.5:       + description            = "Launch template t1-skeleton-eu-central-1-mycluster5"
10:05:21.423 STDOUT terraform1.10.5:       + id                     = (known after apply)
10:05:21.424 STDOUT terraform1.10.5:       + image_id               = (sensitive value)
10:05:21.424 STDOUT terraform1.10.5:       + instance_type          = "t3.medium"
10:05:21.424 STDOUT terraform1.10.5:       + latest_version         = (known after apply)
10:05:21.424 STDOUT terraform1.10.5:       + name                   = "t1-skeleton-eu-central-1-mycluster5-on-demand-lt"
10:05:21.424 STDOUT terraform1.10.5:       + name_prefix            = (known after apply)
10:05:21.424 STDOUT terraform1.10.5:       + tags                   = {
10:05:21.424 STDOUT terraform1.10.5:           + "Environment" = "t1"
10:05:21.424 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
10:05:21.424 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
10:05:21.424 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
10:05:21.424 STDOUT terraform1.10.5:         }
10:05:21.424 STDOUT terraform1.10.5:      
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.